app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
def index
    ingredient = Ingredient.all

INSERT INTO "ingredients" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "apple"], ["user_id", 1], ["created_at", "2020-10-12 18:43:09.013218"], ["updated_at", "2020-10-12 18:43:09.013218"]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
def create
    ingredient = Ingredient.create!(name:params[:name], user_id:params[:user_id])
    all_ingredients = User.find(params[:user_id]).ingredients

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 1]]
---
def destroy
    @ingredient = Ingredient.find(params[:id])
    @user_ingredient = @ingredient.user
    @ingredient.destroy