app/controllers/sessions_controller.rb

    def create
        user = User
        .find_by(email: params["user"]["email"])
        .try(:authenticate, params["user"]["password"])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "tim@hey.com"], ["LIMIT", 1]]