app/controllers/shopping_items_controller.rb

    def index
        shopping_item = ShoppingItem.all
---
SELECT "shopping_items".* FROM "shopping_items"

    def create
        shopping_item = ShoppingItem.create!(recipe:params[:recipe], name:params[:name], user_id:params[:user_id])
        all_shopping_items = User.find(params[:user_id]).shopping_items
---
INSERT INTO "shopping_items" ("recipe", "name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["recipe", "Apple Ginger Kombucha Cocktail"], ["name", "[\"ginger\"]"], ["user_id", 1], ["created_at", "2020-10-18 15:14:21.477470"], ["updated_at", "2020-10-18 15:14:21.477470"]]
SELECT "shopping_items".* FROM "shopping_items" WHERE "shopping_items"."user_id" = ?  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def destroy
        @shopping_item = ShoppingItem.find(params[:id])
        @user_shopping_item = @shopping_item.user
        @shopping_item.destroy
---
SELECT "shopping_items".* FROM "shopping_items" WHERE "shopping_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
DELETE FROM "shopping_items" WHERE "shopping_items"."id" = ?  [["id", 2]]