app/controllers/user_recipes_controller.rb

SELECT "user_recipes".* FROM "user_recipes"
---
  def index
    user_recipe = UserRecipe.all

INSERT INTO "user_recipes" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2020-10-12 23:21:52.273145"], ["updated_at", "2020-10-12 23:21:52.273145"]]
SELECT "user_recipes".* FROM "user_recipes" WHERE "user_recipes"."user_id" = ?  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
def create
    user_recipe = UserRecipe.create!(title:params[:title], ingredients:params[:ingredients], sourceUrl:params[:sourceUrl], image:params[:image], user_id:params[:user_id])
    all_recipes = User.find(params[:user_id]).user_recipes

SELECT "user_recipes".* FROM "user_recipes" WHERE "user_recipes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "user_recipes" WHERE "user_recipes"."id" = ?  [["id", 1]]
---
def destroy

  @user_recipe = UserRecipe.find(params[:id])
  @user_recipe_user = @user_recipe.user
  @user_recipe.destroy